//
//  ViewController.swift
//  projectTextlabel
//
//  Created by macOS on 10/29/20.
//

import UIKit

class ViewController: UIViewController {
    
    var textArray = ["1":"ปี 2019 Google ประกาศว่าจะใช้วัสดุรีไซเคิลเข้ามาในผลิตภัณฑ์ Made By Google ให้ได้ทุกตัวภายในปี 2022 ล่าสุด Google เผยว่าเริ่มใกล้สู่เป้าหมายบางส่วนแล้ว โดยฝาหลัง Pixel 5 ใช้อะลูมิเนียมรีไซเคิล 100% แล้ว และผลิตภัณฑ์ Nest ใช้พลาสติกรีไซเคิล 70% และ Nest Thermostat ตรงส่วนที่ยึดกับผนัง ใช้พลาสติกรีไซเคิลเช่นกัน","2":"Greg Kroah-Hartman ผู้ดูแลเคอร์เนลลินุกซ์ในสาย stable branch ตอบคำถามในงาน Open Source Summit Europe ถึงแนวทางการพูดคุยของกลุ่มนักพัฒนาเคอร์เนลที่ยังใช้อีเมลแบบข้อความล้วน (plaintext) ว่าเป็นอุปสรรคต่อการหานักพัฒนาหน้าใหม่หรือไม่ โดยเขายืนยันว่าทุกสามเดือนที่เป็นรอบออกเวอร์ชั่นใหม่ของลินุกซ์ มีนักพัฒนาหน้าใหม่เข้ามาเรื่อยมากกว่า 200 คน เขายอมรับว่าการตั้งค่าอีเมลไคลเอนต์[ให้ทำงานแบบ plaintext] อาจจะยุ่งยากไปบ้างแต่ทางโครงการเคอร์เนลก็มีเอกสารให้ครบ พร้อมกับชี้ว่าปัญหาไม่ได้อยู่ที่นักพัฒนาไม่ส่งโค้ดแต่กลับเป็นมีโค้ดส่งเข้าไปมากจนรีวิวไม่ทัน Greg ระบุว่ามีคนส่งโค้ดเข้าเตอร์เนลลินุกซ์สัปดาห์ละกว่า 700 แพตช์และกระบวนการรีวิวกลายเป็นคอขวด พร้อมกับเรียกร้องให้นักพัฒนาช่วยกันตรวจโค้ด โดยเทียบกับการแต่งเพลงว่าคนเราไม่ควรข้ามไปแต่งเพลงทันที แต่ควรฟังเพลงและวิจารณ์เพลงเสียก่อน","3":"โรงเรียนสอนขับรถ Minami Fukuoka ในเมืองฟุกุโอะกะ ประเทศญี่ปุ่นหันมาใช้เทคโยโลยีรถไร้คนขับมาวิเคราะห์ความสามารถในการขับขี่ของนักเรียนแทน โดยใช้ทั้งเซ็นเซอร์ LIDAR ตรวจจับวัตถุรอบรถ และปัญญาประดิษฐ์วิเคราะห์หาจุดบกพร่องพร้อมคำแนะนำ ตัวรถที่ใช้เรียนจะติดตั้งกล้องไว้ภายในรถเพื่อจับใบหน้าและดวงตาของนักเรียนไปพร้อมกัน ขณะที่ปัญญาประดิษฐ์จะวิเคราะห์ทั้งวัตถุรอบรถ, การเปลี่ยนเลน, ความเร็วรถ ประกอบการให้คะแนน ทั้งนี้ขณะที่นักเรียนกำลังฝีกจะมีครูนั่งไปด้วย แต่ปัญญาประดิษฐ์จะลดภาระครูในการประเมินนักเรียนแต่ละรอบ หันไปให้คำปรึกษาในการขับขี่แทน โดยญี่ปุ่นมีกำหนดเรียกผู้ถือใบขับขี่สูงอายุกลับมาสอบใบขับขี่ใหม่ในปี 2022 ทำให้ภาระของโรงเรียนสอนขับรถจะหนักขึ้นมาก ปัญญาประดิษฐ์ที่ใช้งานครั้งนี้พัฒนาโดยบริษัท Tier IV และ Brain IV ที่เป็นบริษัทพัฒนารถไร้คนขับอยู่ทั้งคู่ แม้เทคโนโลยีรถไร้คนขับจะพัฒนาขึ้นมาอย่างรวดเร็ว แต่การปรับแก้กฎหมายให้สามารถใช้งานได้จริง เช่น ผู้ขับขี่ไม่รับผิดชอบในการควบคุมรถ หรือแม้แต่ไม่ต้องมีใบขับขี่เลยนั้นต้องใช้เวลาอีกพอสมควร การนำเทคโนโลยีเดียวกันมาใช้ฝึกคนขับขี่เป็นแนวทางการใช้งานที่ใช้ได้ทันที"]

    @IBOutlet weak var scrollView: UIScrollView!
    @IBOutlet weak var label: UILabel!
    override func viewDidLoad() {
        super.viewDidLoad()
        scrollView.contentLayoutGuide.bottomAnchor.constraint(equalTo: label.bottomAnchor).isActive = true
        DispatchQueue.global(qos: .background).async {
                self.doSomething1()
            }
        // Do any additional setup after loading the view.
    }
    func doSomething1() {
        // as good a way as any to simulate a long-running process
        while(true){
            for item in self.textArray {
                sleep(10)
                DispatchQueue.main.async {
                    self.label.text = item.value
                    }
                }
            }
    }
}
